
Функция InfoTestgetFileInfo(Запрос)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Параметр1", Запрос["ПараметрыURL"].Получить("one"));
	ПараметрыЗапроса.Вставить("Параметр2", Запрос["ПараметрыURL"].Получить("two"));
	СтруктураJSON = Новый Структура;
	
	СтруктураJSON.Вставить("Name", ПараметрыЗапроса.Параметр1);
	СтруктураJSON.Вставить("Number", ПараметрыЗапроса.Параметр2);
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураJSON);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Если ПараметрыЗапроса.Параметр1 = "123" Тогда
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON,"UTF-8" , ИспользованиеByteOrderMark.НеИспользовать);
	Иначе
		Ответ = Новый HTTPСервисОтвет(400);
	КонецЕсли;
	Возврат Ответ;
КонецФункции
