
&НаКлиенте
Процедура ПодключитьсяКHTTP(Команда)
	ПодключитьсяКHTTPНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодключитьсяКHTTPНаСервере()
	Попытка
		HTTPСоединение = Новый HTTPСоединение("127.0.0.1",80,,,,,,);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ОписаниеОшибки());
		Сообщить(ТекстОшибки);
	КонецПопытки;

	Параметр1 = "123";
	Параметр2 = "Параметр 2";

	ЗапросHTTP = Новый HTTPЗапрос();
	ЗапросHTTP.АдресРесурса = "/test/hs/HTTPExchange/getInfoTest/" + Параметр1 + "/" + Параметр2 + "/";
	ЗапросHTTP.Заголовки.Вставить("Content-type", "application/json");

	Попытка
		HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
		РезультатОтвета = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ОписаниеОшибки());
		Сообщить(ТекстОшибки);
	КонецПопытки;
КонецПроцедуры
