
&НаКлиенте
Процедура ОтправитьЗапрос(Команда)
	ОтправитьЗапросНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьЗапросНаСервере()
	Сервер = "/api.spacexdata.com";
	Ресурс = "/v3/rockets"; 
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	
	Попытка
		Соединение = Новый HTTPСоединение(Сервер,443,,,,100,ЗащищенноеСоединение);
	Исключение
		Возврат;
	КонецПопытки;
	
	ЗапросПолученияСообщения = Новый HTTPЗапрос(Ресурс); 
	Попытка
		Объект.Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросПолученияСообщения).ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Объект.Ответ);
	Структура = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	КорабльСоздан = "";
	КорабльСоздан = ПолучитьСтрокуНаименованийКораблей();
	
	Для каждого строка из Структура Цикл
		Если СтрНайти(КорабльСоздан, строка.rocket_name) Тогда
			Продолжить;
		КонецЕсли;
		НовыйЭлементСправочникаКорабли = Справочники.Корабли.СоздатьЭлемент();
		НовыйЭлементСправочникаКорабли.ИД = строка.id;
		НовыйЭлементСправочникаКорабли.Наименование = строка.rocket_name;
		НовыйЭлементСправочникаКорабли.НаименованиеРакеты = строка.rocket_name;
		НовыйЭлементСправочникаКорабли.ИДРакеты = строка.rocket_id;
		НовыйЭлементСправочникаКорабли.ТипРакеты = строка.rocket_type;
		НовыйЭлементСправочникаКорабли.Активный = строка.active;
		
		НовыйЭлементСправочникаКорабли.Компания = строка.company;
		НовыйЭлементСправочникаКорабли.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтрокуНаименованийКораблей()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Корабли.Ссылка
		|ИЗ
		|	Справочник.Корабли КАК Корабли";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СтрокаНаименованийКораблей = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаНаименованийКораблей = СтрокаНаименованийКораблей + " " + ВыборкаДетальныеЗаписи.Ссылка + Символы.ПС;
	КонецЦикла;
	
	Возврат СтрокаНаименованийКораблей;

КонецФункции